food-truck-backend/app/controllers/api/v1/auth_controller.rb

    def login
        eater = Eater.find_by(username: auth_param[:username])
---
SELECT "eaters".* FROM "eaters" WHERE "eaters"."username" = $1 LIMIT $2  [["username", "Brian"], ["LIMIT", 1]]

    def token
        # byebug
        header = request.headers["Authorization"]
        token = header.split(" ")[1]
        eater_id = JWT.decode(token, "Test")[0]["eater_id"]
        eater = Eater.find(eater_id)
---
SELECT "eaters".* FROM "eaters" WHERE "eaters"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]