food-truck-backend/app/controllers/api/v1/eaters_controller.rb

    def create
        # byebug
        eater = Eater.new(eater_params)
        if eater.valid?
            eater.save
---
INSERT INTO "eaters" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"