food-truck-backend/app/controllers/api/v1/favorites_controller.rb

    def create
        favorite = Favorite.create(eater_id: params[:eater_id], truck_id: params[:truck_id])
---
INSERT INTO "favorites" ("eater_id", "truck_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["eater_id", 7], ["truck_id", 6], ["created_at", "2021-05-24 22:25:54.726859"], ["updated_at", "2021-05-24 22:25:54.726859"]]

    def destroy
        favorite = Favorite.find(params[:id])
        favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 45]]