food-truck-backend/app/controllers/api/v1/reviews_controller.rb

INSERT INTO "reviews" ("eater_id", "truck_id", "rating", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["eater_id", 18], ["truck_id", 20], ["rating", 5], ["body", "Great tacos"], ["created_at", "2021-05-26 22:01:28.162838"], ["updated_at", "2021-05-26 22:01:28.162838"]]
---
    def create
        review = Review.new(eater_id: params[:eater_id], truck_id: params[:truck_id], rating: params[:rating], body: params[:body])
        if review.valid?
            review.save