food-truck-backend/app/controllers/api/v1/trucks_controller.rb

SELECT "trucks".* FROM "trucks"
---
    def index
        trucks = Truck.all