food-truck-backend/app/models/truck.rb

    def average_rating
        ratings = self.reviews.map{|review| review.rating}
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."truck_id" = $1  [["truck_id", 17]]